intermediatePlus/snappyHexMesh_and_freeCAD_cases/pipedHeatExchg_salome_poly_BL/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    "(coldSideTubing|insulatedTubing|hotSideTubing)"
    {
        type            noSlip;
    }
    inlet
    {
        type                    flowRateInletVelocity;
        volumetricFlowRate      0.0022;
        //extrapolateProfile      yes;
        value                   $internalField;


    }

}

// ************************************************************************* //
