intermediatePlus/snappyHexMesh_and_freeCAD_cases/pipedHeatExchg_salome_poly_BL/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    "(coldSideTubing|insulatedTubing|hotSideTubing)"
    {
        type            calculated;
        value           $internalField;
    }
    inlet 
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
